[
  {
    "date": "February 2025",
    "title": "Fully Funded Scholarship at University of Central Florida",
    "content": "We are thrilled to share that another student from iCodeGuru has secured a fully funded Ph.D. position at the University of Central Florida (UCF)! This opportunity includes full tuition sponsorship, a generous stipend, conference travel funding, and access to cutting-edge research facilities. At iCodeGuru, we are committed to providing free mentorship, courses, and guidance to help students build strong profiles and secure life-changing scholarships worldwide.",
    "tags": [
      "FullyFunded",
      "PhD",
      "Scholarships",
      "SuccessStory"
    ]
  },
  {
    "date": "February 2025",
    "title": "Announcement - Courses, Workshops & Webinar",
    "content": "iCodeGuru is excited to bring its students amazing opportunities: IELTS Prep for Scholarships, Advance WordPress Engineering BootCamp, Chrome Extension Workshop, Firebase Workshop, and a webinar on Scaling Tech Careers Beyond Borders.",
    "tags": [
      "Courses",
      "Workshops",
      "Webinar",
      "TechEducation"
    ]
  },
  {
    "date": "February 2025",
    "title": "Afsheen Ghuman's Fully Funded Scholarship Success",
    "content": "Afsheen Ghuman has secured a fully funded scholarship from GIFT University to Grand Valley State University, USA. Afsheen transformed her profile in just four months through strategic learning, teaching sessions, and active hackathon participation.",
    "tags": [
      "ScholarshipSuccess",
      "WomenInSTEM",
      "GIFTUniversity",
      "Hackathon"
    ]
  },
  {
    "date": "February 2025",
    "title": "First Urdu Large Language Model Released",
    "content": "Urdu's first LLM, Alif-1.0, has been released on Hugging Face. Built by Muhammad Arham and the LARGE team, this model outperforms existing multilingual models and democratizes AI access for Urdu speakers.",
    "tags": [
      "UrduAI",
      "LLM",
      "HuggingFace",
      "MachineLearning",
      "Innovation"
    ]
  },
  {
    "date": "February 2025",
    "title": "Safia Fiaz Achieves 7.5 Band in IELTS",
    "content": "Safia Fiaz, a learner at iCodeGuru, achieved an impressive Overall Band 7.5 in the IELTS Academic Test with just two weeks of preparation. Her strategy included practicing Cambridge IELTS books and utilizing YouTube resources.",
    "tags": [
      "IELTS",
      "StudentSuccess",
      "EmpoweringEducation"
    ]
  },
  {
    "date": "February 2025",
    "title": "AI for Connectivity Hackathon Victory",
    "content": "iCodeGuru students Malik Zubair, Hamna Dawood, Bakht Ullah Jan, and Sohaib Aamir emerged as winners in the AI for Connectivity Hackathon by lablab.ai. Their project focused on forecasting network connectivity using AI models.",
    "tags": [
      "Hackathon",
      "AIForConnectivity",
      "AIInnovation",
      "TechLeadership"
    ]
  },
  {
    "date": "February 2025",
    "title": "Upcoming Courses and Workshops",
    "content": "New courses announced: Web Development Unleashed, Mathematics for AI, IoT Smart Solutions, and React Bootcamp. Special webinar: Pathway to US Immigration (O1-A Talent Visa) by Sarim Nadeem.",
    "tags": [
      "Courses",
      "Workshops",
      "Webinar",
      "USImmigration"
    ]
  },
  {
    "date": "February 2025",
    "title": "Australia Awards Scholarships Webinar",
    "content": "Webinar titled 'Achieve Your Dreams: Australia Awards Scholarships for International Students' featuring guest speaker Komal Fatima.",
    "tags": [
      "Scholarships",
      "Webinar",
      "AustraliaAwards",
      "EducationAbroad"
    ]
  },
  {
    "date": "February 2025",
    "title": "Umar Mazhar Achieves 6.5 Band in IELTS",
    "content": "Umar Mazhar scored 6.5 Band in IELTS Academic, balancing university commitments and preparation. His success was supported by iCodeGuru's free resources and mentorship.",
    "tags": [
      "IELTS",
      "StudentSuccess",
      "EmpoweringEducation"
    ]
  },
  {
    "date": "May 2024",
    "title": "Fall 2024 Fully Funded Scholarships in USA Results",
    "content": "iCodeGuru students have secured fully funded scholarships in 18 USA universities including McGill, University of Utah, and Kansas State University. Profiles include CGPA 3.1-3.8, IELTS 6.5-7.5, and $0 bank statements.",
    "tags": [
      "FullyFunded",
      "USA",
      "Scholarships",
      "Fall2024"
    ]
  }
]