[
  {
    "type": "paragraph",
    "text": "Recent Achievements"
  },
  {
    "type": "paragraph",
    "text": "600"
  },
  {
    "type": "paragraph",
    "text": "Hackathon Awards"
  },
  {
    "type": "paragraph",
    "text": "400"
  },
  {
    "type": "paragraph",
    "text": "Scholarship Aspirants"
  },
  {
    "type": "paragraph",
    "text": "20"
  },
  {
    "type": "paragraph",
    "text": "Students"
  },
  {
    "type": "paragraph",
    "text": "22000"
  },
  {
    "type": "paragraph",
    "text": "About Us"
  },
  {
    "type": "paragraph",
    "text": "iCode Guru's mission is to promote the programming at scale. (100% Free)"
  },
  {
    "type": "paragraph",
    "text": "Our Mission"
  },
  {
    "type": "paragraph",
    "text": "At iCodeGuru (registered in California, USA) we're focused on a mission to uplift promising talent from underprivileged areas and help them reach their full potential in the tech sector."
  },
  {
    "type": "paragraph",
    "text": "We collaborate with top Silicon Valley talent to offer extensive training, mentorship, and direction. This empowers our students with the cutting-edge skills and industry acumen needed to secure prestigious careers at leading tech companies."
  },
  {
    "type": "paragraph",
    "text": "Beyond immediate employment, we empower our students with the entrepreneurial spirit and experience required to become future industry leaders. They graduate not only as highly talented engineers and diligent developers but also with the confidence and ability to start their own successful ventures."
  },
  {
    "type": "paragraph",
    "text": "Contact Us"
  },
  {
    "type": "paragraph",
    "text": "Email: info@icode.guru"
  },
  {
    "type": "paragraph",
    "text": "Location: San Jose, CA, USA"
  },
  {
    "type": "paragraph",
    "text": "iCodeGuru Alumni"
  },
  {
    "type": "paragraph",
    "text": "Muhammad Talha"
  },
  {
    "type": "paragraph",
    "text": "do connect with him/he on LinkedIn Muhammad Talha | LinkedIn"
  },
  {
    "type": "paragraph",
    "text": "A PhD researcher at the University of Missouri-Kansas City, specializing in 3D Point Cloud Compression, Denoising, and Deblocking using SparseConv and advanced ML. Skilled in Python, PyTorch, Minkowski Engine, and MySQL, with hands-on experience in backend development, robotic vision, and IoT. Also experienced in mechanical control systems and electrical systems including transmission lines, VFDs, and power control circuits."
  },
  {
    "type": "paragraph",
    "text": "Azib Farooq"
  },
  {
    "type": "paragraph",
    "text": "do connect with him/he on Azib Farooq | LinkedIn"
  },
  {
    "type": "paragraph",
    "text": "Azib is a self-starter and passionate software engineer with experience at Algolab, known for solving complex problems under pressure. He actively explores emerging technologies and participates in global hackathons, driving innovation through collaboration. His tech stack spans C++, Python, React, Node.js, Flask, TensorFlow, and more. Azib is open to collaborative projects and software engineering roles."
  },
  {
    "type": "paragraph",
    "text": "Asif Rasool"
  },
  {
    "type": "paragraph",
    "text": "do connect with him/he on Asif Rasool | LinkedIn"
  },
  {
    "type": "paragraph",
    "text": "Currently working as a Data Engineer at Bloomwell Group in Frankfurt, Germany, with a strong focus on data vault modeling, AWS, and analytics using Python, SQL, Power BI, and Tableau. With a diverse background in development, research, and teaching, they actively engage in LeetCode problem-solving and international hackathons. Passionate about all things data, they are open to roles in Data Engineering, Analytics, BI, and Database Development."
  },
  {
    "type": "paragraph",
    "text": "Huma Jamil"
  },
  {
    "type": "paragraph",
    "text": "do connect with her/she on Huma Jamil | LinkedIn"
  },
  {
    "type": "paragraph",
    "text": "A PhD candidate in Computer Science with a Master's in Mathematics, specializing in computer vision and the inner workings of deep neural networks. Skilled in C++, Python, and libraries like PyTorch, Scipy, and Sklearn. With 300+ LeetCode problems solved, they bring strong problem-solving and debugging skills, making them a valuable team player."
  },
  {
    "type": "paragraph",
    "text": "Saira Gillani"
  },
  {
    "type": "paragraph",
    "text": "do connect with her/she on Saira Gillani | LinkedIn"
  },
  {
    "type": "paragraph",
    "text": "A dedicated Demand Planner with 3 years of experience, specializing in ERP and WMS integration for inventory optimization and accurate forecasting. Proficient in Microsoft Dynamics 365, Anaplan, Python, SQL, Power BI, and Tableau. Skilled in using data analytics and visualization to support strategic supply chain decisions."
  },
  {
    "type": "paragraph",
    "text": "Iqbal Khatoon"
  },
  {
    "type": "paragraph",
    "text": "do connect with her/she on Iqbal Khatoon | LinkedIn"
  },
  {
    "type": "paragraph",
    "text": "A passionate tech professional and educator with an MS in Computer Science from the University of Wyoming, USA, and rich experience in teaching and mentoring. Former Instructor at the University of Wyoming, teaching Computational Thinking and Programming. Has taught courses like OS, DSA, ML, and Python both at university and through an online platform in San Jose, CA. Dedicated to inspiring a love for coding and problem-solving in students."
  },
  {
    "type": "paragraph",
    "text": "Rehmana Younis"
  },
  {
    "type": "paragraph",
    "text": "do connect with her/she on Rehmana Younis | LinkedIn"
  },
  {
    "type": "paragraph",
    "text": "A Site Reliability Engineer with expertise in Machine Learning, MLOps, Python, and Large Language Models. Specializes in automation, deployment, and CI/CD pipelines to ensure efficient and scalable systems. Passionate about leveraging cutting-edge technologies to drive business growth and innovation."
  },
  {
    "type": "paragraph",
    "text": "Muhammad Ayiaz"
  },
  {
    "type": "paragraph",
    "text": "do connect with him/he on Muhammad Ayiaz | LinkedIn"
  },
  {
    "type": "paragraph",
    "text": "A dedicated doctorate student actively engaged in advanced research and academic exploration. Passionate about contributing to knowledge in their specialized field through rigorous study and innovation. Equipped with strong analytical, research, and problem-solving skills. Committed to academic excellence and meaningful impact."
  },
  {
    "type": "paragraph",
    "text": "Zubair Zafar"
  },
  {
    "type": "paragraph",
    "text": "do connect with him/he on Zubair Zafar | LinkedIn"
  },
  {
    "type": "paragraph",
    "text": "Currently a Graduate Assistant at EIU and former software engineering intern at Etihad Aviation Group, with a strong foundation in full-stack development, ML, and containerization. Skilled in technologies like React, Django, Node.js, Docker, and TensorFlow. A passionate mentor and hackathon winner, with teaching experience at Stanford's Code in Place and volunteer work in Pakistan. Committed to solving problems and contributing to impactful research and innovation."
  },
  {
    "type": "paragraph",
    "text": "Shaheer Khan"
  },
  {
    "type": "paragraph",
    "text": "do connect with him/he on Shaheer khan | LinkedIn"
  },
  {
    "type": "paragraph",
    "text": "A passionate Machine Learning Engineer with a mission to inspire others and make a positive impact through technology. Experienced in ML, Data Science, BI tools (Power BI, Oracle Analytics), and cloud services like Azure and Salesforce. Actively delivers webinars, hosts speaker sessions, and builds data-driven solutions using tools like TensorFlow, Scikit-learn, and Docker. Committed to continuous learning and serving the tech community with purpose and passion."
  },
  {
    "type": "paragraph",
    "text": "Afsheen Ghuman"
  },
  {
    "type": "paragraph",
    "text": "do connect with her/she on Afsheen Ghuman | LinkedIn"
  },
  {
    "type": "paragraph",
    "text": "A Graduate Assistant at Grand Valley State University, contributing to research in digital evolution and adaptive learning algorithms. With experience in Laravel, Python, and AI, they build scalable web apps and mentor developers through workshops and LeetCode training. Recognized in multiple hackathons for AI-driven solutions in healthcare and analytics. Passionate about the intersection of AI, software engineering, and digital innovation."
  },
  {
    "type": "paragraph",
    "text": "Nimra Safdar"
  },
  {
    "type": "paragraph",
    "text": "do connect with her/she on Nimra Safdar | LinkedIn"
  },
  {
    "type": "paragraph",
    "text": "A dedicated bioinformatician and PhD researcher at Miami University, specializing in AI/ML applications in biology and single-cell RNA data analysis. A gold medalist from the University of Agriculture Faisalabad, with strong expertise in Python, R, and computational biology. Actively involved in research projects, hackathons, and coding competitions, aiming to uncover biological insights through advanced computational methods."
  },
  {
    "type": "paragraph",
    "text": "Aimen Sadaat"
  },
  {
    "type": "paragraph",
    "text": "do connect with her/she on Aimen S. | LinkedIn"
  },
  {
    "type": "paragraph",
    "text": "A PhD student in EECS at Wichita State University, researching security and privacy with a focus on Android privacy leaks. Combines a background in electronic engineering with experience teaching math and physics. Currently serving as a Graduate Teaching Assistant, passionate about advancing mobile security and protecting user privacy through research and education."
  },
  {
    "type": "paragraph",
    "text": "Ahmed Jajja"
  },
  {
    "type": "paragraph",
    "text": "do connect with him/he on Ahmad Jajja | LinkedIn"
  },
  {
    "type": "paragraph",
    "text": "Ahmad is a Software Engineer, Trainer, and CS Graduate Student at Montana State University, currently building web, desktop, and GenAI solutions. With expertise in Generative AI (Python, LLMs, RAG), MERN stack, and React Native, he has trained 2000+ students and participated in international hackathons. Passionate about teaching, freelancing, and solving real-world problems through innovative technologies."
  },
  {
    "type": "paragraph",
    "text": "Faraz Shoaib"
  },
  {
    "type": "paragraph",
    "text": "do connect with him/he on Faraz Shoaib | LinkedIn"
  },
  {
    "type": "paragraph",
    "text": "With a background in Electrical Engineering and industry experience at Siemens, now pursuing a PhD in Computer Science at Wichita State University. Focused on research at the intersection of AI and Cybersecurity to protect and enhance digital systems. Combines expertise in both hardware and software with a passion for impactful, collaborative innovation."
  },
  {
    "type": "paragraph",
    "text": "Hafsa Raza"
  },
  {
    "type": "paragraph",
    "text": "do connect with her/she on Hafsa Raza | LinkedIn"
  },
  {
    "type": "paragraph",
    "text": "A Research Assistant at the University of Gujrat with over a year of experience in Lithium-ion battery research using C++, Python, and simulation tools. Holds a bachelor's degree in Physics and is passionate about scientific innovation and collaboration. Eager to pursue advanced studies and contribute to the field of Material Science."
  },
  {
    "type": "paragraph",
    "text": "Fiza Ashraf"
  },
  {
    "type": "paragraph",
    "text": "do connect with her/she on Fiza Ashraf | LinkedIn"
  },
  {
    "type": "paragraph",
    "text": "A seasoned backend developer with expertise in distributed systems and data platforms, previously Backend Lead at Afiniti and engineer at Motive. Skilled in Python, Flask, Django, AWS, Docker, and Kubernetes, with a passion for solving complex problems and optimizing systems. An active open-source contributor, tech blogger, and mentor dedicated to innovation and collaboration."
  },
  {
    "type": "paragraph",
    "text": "Tanish kumar"
  },
  {
    "type": "paragraph",
    "text": "do connect with him/he on Tanish Kumar | LinkedIn"
  },
  {
    "type": "paragraph",
    "text": "A Graduate Research Assistant at Northern Illinois University, actively engaged in academic research and innovation. Brings strong analytical and technical skills to contribute to impactful projects. Passionate about continuous learning and exploring opportunities in research and development."
  },
  {
    "type": "paragraph",
    "text": "Mohammad Shaheer"
  },
  {
    "type": "paragraph",
    "text": "do connect with him/he on Mohammad Shaheer | LinkedIn"
  },
  {
    "type": "paragraph",
    "text": "An Electrical Engineer specializing in Embedded Systems, with a passion for algorithm optimization and data science. Gained hands-on industry experience working on projects like milk-quality sensors, FinTech handheld devices, GNSS receivers, and LLM-based productivity tools. Focused on developing innovative hardware-software solutions that drive real-world impact."
  },
  {
    "type": "paragraph",
    "text": "Mohsin Rasheed"
  },
  {
    "type": "paragraph",
    "text": "do connect with him/he on Mohsin Rasheed | LinkedIn"
  },
  {
    "type": "paragraph",
    "text": "A PhD candidate in Computer Science at Augusta University, specializing in blockchain, distributed computing, and HPC. As a Graduate Research Assistant, focuses on vector databases, sharding, and optimizing edge computing systems. Passionate about solving complex problems and integrating machine learning to boost system performance."
  },
  {
    "type": "paragraph",
    "text": "Faisal Latif"
  },
  {
    "type": "paragraph",
    "text": "do connect with him/he on Faisal Latif | LinkedIn"
  },
  {
    "type": "paragraph",
    "text": "A dedicated Teaching Assistant with a strong passion for education and student success. Skilled in supporting course instruction, guiding students through complex concepts, and fostering an engaging learning environment. Committed to academic excellence and continuous learning."
  },
  {
    "type": "paragraph",
    "text": "Maria Baloch"
  },
  {
    "type": "paragraph",
    "text": "do connect with her/she on Maria Baloch | LinkedIn"
  },
  {
    "type": "paragraph",
    "text": "A machine learning researcher focused on deep neural network architectures, with strong proficiency in Python and tools like PyTorch, Scipy, and Scikit-learn. Backed by a solid foundation in computer science and 100+ solved DSA problems on LeetCode. Skilled in debugging and problem-solving, bringing value to collaborative, research-driven teams."
  },
  {
    "type": "paragraph",
    "text": "Kaneez Fatima"
  },
  {
    "type": "paragraph",
    "text": "do connect with her/she on Kaneez Fatima | LinkedIn"
  },
  {
    "type": "paragraph",
    "text": "Skilled in backend development, database migration, and object-oriented programming, with a strong focus on building scalable and distributed systems. Proven problem solver, dedicated to delivering well-designed solutions for companies worldwide. Passionate about writing clean, efficient code and driving impactful results."
  },
  {
    "type": "paragraph",
    "text": "Share Your Skills"
  },
  {
    "type": "paragraph",
    "text": "Do you want to volunteer teaching on our platform, are you looking for an opportunity to learn by teaching? We provide opportunity to all those students who have big dreams in their career."
  },
  {
    "type": "paragraph",
    "text": "Learn with others"
  },
  {
    "type": "paragraph",
    "text": "If you want to boost your learning, you should learn skills in a cohort. We provide many cohorts so you can engage with others to enhance your skills."
  },
  {
    "type": "paragraph",
    "text": "Grow Professionally"
  },
  {
    "type": "paragraph",
    "text": "Your Network is your Networth\" We provide opportunity to students to interact with international mentors from Silicon Valley."
  },
  {
    "type": "paragraph",
    "text": "Watch Video Tutorial"
  },
  {
    "type": "paragraph",
    "text": "https://www.youtube.com/watch?v=JC9A8bvJMWQ&embeds_referring_euri=https%3A%2F%2Ficode.guru%2F"
  },
  {
    "type": "paragraph",
    "text": "Follow us on Linkedin iCodeGuru: Posts | LinkedIn"
  },
  {
    "type": "paragraph",
    "text": "Meet the iCodeGuru Team"
  },
  {
    "type": "paragraph",
    "text": "Dr. Zafar Shahid (President) Zafar Shahid, PhD | LinkedIn"
  },
  {
    "type": "paragraph",
    "text": "A seasoned software professional with over 15 years of experience in real-time systems, multimedia, and network stacks across embedded, desktop, and immersive platforms like Windows, Linux, Android, and Oculus. Expert in low-latency pipelines, video codecs, streaming protocols, and DSP firmware. Proficient in C/C++, Python, and multimedia tools like FFMpeg and OpenMAX. Skilled across the full software development lifecycle, from requirement analysis to deployment."
  },
  {
    "type": "paragraph",
    "text": "Rizwan Ghaffar (Senior Vice President) Rizwan Ghaffar | LinkedIn"
  },
  {
    "type": "paragraph",
    "text": "With over 15 years of experience in wireless communications—including 5G, LTE, satellite, WiFi, and Bluetooth—this expert specializes in algorithm design, hardware architecture, and system optimization. Skilled in Python, C/C++, and MATLAB, with a proven track record of end-to-end project development and cross-functional collaboration. Passionate about teaching, performance debugging, and contributing to impactful advancements in wireless technologies."
  },
  {
    "type": "paragraph",
    "text": "Kaleem Anwar (Senior Vice President) Kaleem Anwar | LinkedIn"
  },
  {
    "type": "paragraph",
    "text": "An experienced team and tech leader with a strong track record in building and guiding high-performing teams. Skilled System Architect with expertise in Android, Embedded Linux, and RTOS, leading full product lifecycles across smartphones, tablets, STBs, and AR/VR. Hands-on with advanced technologies in AI, ML, DL, computer vision, and operating systems. Passionate about driving innovation and delivering impactful products."
  },
  {
    "type": "paragraph",
    "text": "Amir Khan (VP Branding & Marketing) Amir Khan | LinkedIn"
  },
  {
    "type": "paragraph",
    "text": "An AI-driven Digital Marketing Strategist and Digital Transformation Expert with over a decade of experience empowering businesses and executives through AI, ML, and data-driven strategies. Serves as a Generative AI Leadership Coach and trusted advisor to C-suite leaders, guiding digital innovation and personal branding. Specializes in crafting transformative marketing strategies, enabling scalable AI integration, and preparing organizations for the future."
  },
  {
    "type": "paragraph",
    "text": "Khalid Khokhar (VP Public Affairs) Khalid Khokhar | LinkedIn"
  },
  {
    "type": "paragraph",
    "text": "K K Builders specializes in crafting fine homes that blend quality, elegance, and functionality. With a commitment to excellence in design and construction, they deliver residential spaces tailored to modern lifestyles. Trusted for precision, reliability, and attention to detail, K K Builders turns dreams into beautifully built homes."
  },
  {
    "type": "paragraph",
    "text": "What do we offer ?"
  },
  {
    "type": "paragraph",
    "text": "Weekly Webinars"
  },
  {
    "type": "paragraph",
    "text": "We conduct weekly webinars ever Saturday 9:00 PM PKT to help students interact with Silicon Valley Engineers."
  },
  {
    "type": "paragraph",
    "text": "Data Structures and Algorithms"
  },
  {
    "type": "paragraph",
    "text": "If you want to boost your learning, you should learn skills in a cohort. We provide many cohorts so you can engage with others to enhance your skills."
  },
  {
    "type": "paragraph",
    "text": "Career Services"
  },
  {
    "type": "paragraph",
    "text": "Get your CV, Statement of Purpose, Linkedin reviewed by our experts for free."
  },
  {
    "type": "paragraph",
    "text": "Hackathon Announcement"
  },
  {
    "type": "paragraph",
    "text": "Our dedicated team is responsible for announcing webinars every month."
  },
  {
    "type": "paragraph",
    "text": "Machine Learning/ Data Science Announcement"
  },
  {
    "type": "paragraph",
    "text": "Learn emerging technologies in cohort to maximize your learning journey."
  },
  {
    "type": "paragraph",
    "text": "Full Stack Web & App development courses"
  },
  {
    "type": "paragraph",
    "text": "Advance Courses of Website and Application development are taught by industry experts."
  },
  {
    "type": "paragraph",
    "text": "IELTS & GRE Classes"
  },
  {
    "type": "paragraph",
    "text": "Prepare IELTS & GRE for 100 percent free to avail international opportunities."
  },
  {
    "type": "paragraph",
    "text": "You can find upcoming events here iCode Guru"
  }
]